name: "gating-BN-Inception"

layer {
  name: "data"
  type: "VideoData"
  top: "data"
  top: "label"
  video_data_param {
    source: "/home/zhujiagang/zjg_code/temporal-segment-networks/data/ucf_train_3.txt"
    batch_size: 4
    new_length: 5
    num_segments: 3
    shuffle: true
    #modality: FLOW
  }
  transform_param{
    crop_size: 224
    mirror: true
    fix_crop: true
    more_fix_crop: true
    multi_scale: true
    max_distort: 1

    scale_ratios: [1,0.875,0.75,0.66]
    #mean_value: 128
    mean_value: [128, 128, 128, 128, 128, 128,
                128, 128, 128, 128, 128, 128,
                128, 128, 128, 128, 128, 128,
                128, 128, 128, 128, 128, 128,
                128, 128, 128, 128, 128, 128,
                104, 117, 123, 104, 117, 123, 104, 117, 123]
    is_flow: true
  }
  include: { phase: TRAIN }
}


layer {
  name: "data"
  type: "VideoData"
  top: "data"
  top: "label"
  video_data_param {
    source: "/home/zhujiagang/zjg_code/temporal-segment-networks/data/ucf_val_3.txt"
    batch_size: 4
    new_length: 5
    num_segments: 3
    #modality: FLOW
  }
  transform_param{
    crop_size: 224
    mirror: false
    #mean_value: 128
    mean_value: [128, 128, 128, 128, 128, 128,
                128, 128, 128, 128, 128, 128,
                128, 128, 128, 128, 128, 128,
                128, 128, 128, 128, 128, 128,
                128, 128, 128, 128, 128, 128,
                104, 117, 123, 104, 117, 123, 104, 117, 123]
    is_flow: true
  }
  include: { phase: TEST }
}

layer {
  name: "slice_data"
  type: "Slice"
  bottom: "data"
  top: "flow_data"
  top: "rgb_data"
  slice_param{
    axis: 1
    slice_point: 30
  }
}


layer { name: "flow_data_reshape" type: "Reshape" bottom: "flow_data" top: "flow_data_reshape" reshape_param { shape { dim: [-1, 10, 224, 224] } }}
####################################### conv1 #######################################
layer { name: "flow_conv1/7x7_s2" type: "Convolution" bottom: "flow_data_reshape" top: "flow_conv1/7x7_s2"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 64 pad: 3 kernel_size: 7 stride: 2
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_conv1/7x7_s2_bn" type: "BN" bottom: "flow_conv1/7x7_s2" top: "flow_conv1/7x7_s2_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: false slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_conv1/relu_7x7" type: "ReLU" bottom: "flow_conv1/7x7_s2_bn" top: "flow_conv1/7x7_s2_bn" }
layer { name: "flow_pool1/3x3_s2" type: "Pooling" bottom: "flow_conv1/7x7_s2_bn" top: "flow_pool1/3x3_s2"
  pooling_param { pool: MAX kernel_size: 3 stride: 2 } }

####################################### conv2 #######################################
layer { name: "flow_conv2/3x3_reduce" type: "Convolution" bottom: "flow_pool1/3x3_s2" top: "flow_conv2/3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_conv2/3x3_reduce_bn" type: "BN" bottom: "flow_conv2/3x3_reduce" top: "flow_conv2/3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_conv2/relu_3x3_reduce" type: "ReLU" bottom: "flow_conv2/3x3_reduce_bn" top: "flow_conv2/3x3_reduce_bn" }
layer { name: "flow_conv2/3x3" type: "Convolution" bottom: "flow_conv2/3x3_reduce_bn" top: "flow_conv2/3x3"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 192 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_conv2/3x3_bn" type: "BN" bottom: "flow_conv2/3x3" top: "flow_conv2/3x3_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_conv2/relu_3x3" type: "ReLU" bottom: "flow_conv2/3x3_bn" top: "flow_conv2/3x3_bn" }
layer { name: "flow_pool2/3x3_s2" type: "Pooling" bottom: "flow_conv2/3x3_bn" top: "flow_pool2/3x3_s2"
  pooling_param { pool: MAX kernel_size: 3 stride: 2 } }

####################################### inception_3a #######################################
layer { name: "flow_inception_3a/1x1" type: "Convolution" bottom: "flow_pool2/3x3_s2" top: "flow_inception_3a/1x1"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3a/1x1_bn" type: "BN" bottom: "flow_inception_3a/1x1" top: "flow_inception_3a/1x1_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3a/relu_1x1" type: "ReLU" bottom: "flow_inception_3a/1x1_bn" top: "flow_inception_3a/1x1_bn" }
layer { name: "flow_inception_3a/3x3_reduce" type: "Convolution" bottom: "flow_pool2/3x3_s2" top: "flow_inception_3a/3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3a/3x3_reduce_bn" type: "BN" bottom: "flow_inception_3a/3x3_reduce" top: "flow_inception_3a/3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3a/relu_3x3_reduce" type: "ReLU" bottom: "flow_inception_3a/3x3_reduce_bn" top: "flow_inception_3a/3x3_reduce_bn" }
layer { name: "flow_inception_3a/3x3" type: "Convolution" bottom: "flow_inception_3a/3x3_reduce_bn" top: "flow_inception_3a/3x3"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 64 pad: 1 kernel_size: 3
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3a/3x3_bn" type: "BN" bottom: "flow_inception_3a/3x3" top: "flow_inception_3a/3x3_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3a/relu_3x3" type: "ReLU" bottom: "flow_inception_3a/3x3_bn" top: "flow_inception_3a/3x3_bn" }
layer { name: "flow_inception_3a/double_3x3_reduce" type: "Convolution" bottom: "flow_pool2/3x3_s2" top: "flow_inception_3a/double_3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3a/double_3x3_reduce_bn" type: "BN" bottom: "flow_inception_3a/double_3x3_reduce" top: "flow_inception_3a/double_3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3a/relu_double_3x3_reduce" type: "ReLU" bottom: "flow_inception_3a/double_3x3_reduce_bn" top: "flow_inception_3a/double_3x3_reduce_bn" }
layer { name: "flow_inception_3a/double_3x3_1" type: "Convolution" bottom: "flow_inception_3a/double_3x3_reduce_bn" top: "flow_inception_3a/double_3x3_1"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3a/double_3x3_1_bn" type: "BN" bottom: "flow_inception_3a/double_3x3_1" top: "flow_inception_3a/double_3x3_1_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3a/relu_double_3x3_1" type: "ReLU" bottom: "flow_inception_3a/double_3x3_1_bn" top: "flow_inception_3a/double_3x3_1_bn" }
layer { name: "flow_inception_3a/double_3x3_2" type: "Convolution" bottom: "flow_inception_3a/double_3x3_1_bn" top: "flow_inception_3a/double_3x3_2"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3a/double_3x3_2_bn" type: "BN" bottom: "flow_inception_3a/double_3x3_2" top: "flow_inception_3a/double_3x3_2_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3a/relu_double_3x3_2" type: "ReLU" bottom: "flow_inception_3a/double_3x3_2_bn" top: "flow_inception_3a/double_3x3_2_bn" }
layer { name: "flow_inception_3a/pool" type: "Pooling" bottom: "flow_pool2/3x3_s2" top: "flow_inception_3a/pool"
  pooling_param { pool: AVE kernel_size: 3 stride: 1 pad: 1 } }
layer { name: "flow_inception_3a/pool_proj" type: "Convolution" bottom: "flow_inception_3a/pool" top: "flow_inception_3a/pool_proj"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 32 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3a/pool_proj_bn" type: "BN" bottom: "flow_inception_3a/pool_proj" top: "flow_inception_3a/pool_proj_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3a/relu_pool_proj" type: "ReLU" bottom: "flow_inception_3a/pool_proj_bn" top: "flow_inception_3a/pool_proj_bn" }
layer { name: "flow_inception_3a/output" type: "Concat"
  bottom: "flow_inception_3a/1x1_bn"
  bottom: "flow_inception_3a/3x3_bn"
  bottom: "flow_inception_3a/double_3x3_2_bn"
  bottom: "flow_inception_3a/pool_proj_bn"
  top: "flow_inception_3a/output" }

####################################### inception_3b #######################################
layer { name: "flow_inception_3b/1x1" type: "Convolution" bottom: "flow_inception_3a/output" top: "flow_inception_3b/1x1"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3b/1x1_bn" type: "BN" bottom: "flow_inception_3b/1x1" top: "flow_inception_3b/1x1_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3b/relu_1x1" type: "ReLU" bottom: "flow_inception_3b/1x1_bn" top: "flow_inception_3b/1x1_bn" }
layer { name: "flow_inception_3b/3x3_reduce" type: "Convolution" bottom: "flow_inception_3a/output" top: "flow_inception_3b/3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3b/3x3_reduce_bn" type: "BN" bottom: "flow_inception_3b/3x3_reduce" top: "flow_inception_3b/3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3b/relu_3x3_reduce" type: "ReLU" bottom: "flow_inception_3b/3x3_reduce_bn" top: "flow_inception_3b/3x3_reduce_bn" }
layer { name: "flow_inception_3b/3x3" type: "Convolution" bottom: "flow_inception_3b/3x3_reduce_bn" top: "flow_inception_3b/3x3"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3b/3x3_bn" type: "BN" bottom: "flow_inception_3b/3x3" top: "flow_inception_3b/3x3_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3b/relu_3x3" type: "ReLU" bottom: "flow_inception_3b/3x3_bn" top: "flow_inception_3b/3x3_bn" }
layer { name: "flow_inception_3b/double_3x3_reduce" type: "Convolution" bottom: "flow_inception_3a/output" top: "flow_inception_3b/double_3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3b/double_3x3_reduce_bn" type: "BN" bottom: "flow_inception_3b/double_3x3_reduce" top: "flow_inception_3b/double_3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3b/relu_double_3x3_reduce" type: "ReLU" bottom: "flow_inception_3b/double_3x3_reduce_bn" top: "flow_inception_3b/double_3x3_reduce_bn" }
layer { name: "flow_inception_3b/double_3x3_1" type: "Convolution" bottom: "flow_inception_3b/double_3x3_reduce_bn" top: "flow_inception_3b/double_3x3_1"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3b/double_3x3_1_bn" type: "BN" bottom: "flow_inception_3b/double_3x3_1" top: "flow_inception_3b/double_3x3_1_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3b/relu_double_3x3_1" type: "ReLU" bottom: "flow_inception_3b/double_3x3_1_bn" top: "flow_inception_3b/double_3x3_1_bn" }
layer { name: "flow_inception_3b/double_3x3_2" type: "Convolution" bottom: "flow_inception_3b/double_3x3_1_bn" top: "flow_inception_3b/double_3x3_2"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3b/double_3x3_2_bn" type: "BN" bottom: "flow_inception_3b/double_3x3_2" top: "flow_inception_3b/double_3x3_2_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3b/relu_double_3x3_2" type: "ReLU" bottom: "flow_inception_3b/double_3x3_2_bn" top: "flow_inception_3b/double_3x3_2_bn" }
layer { name: "flow_inception_3b/pool" type: "Pooling" bottom: "flow_inception_3a/output" top: "flow_inception_3b/pool"
  pooling_param { pool: AVE kernel_size: 3 stride: 1 pad: 1 } }
layer { name: "flow_inception_3b/pool_proj" type: "Convolution" bottom: "flow_inception_3b/pool" top: "flow_inception_3b/pool_proj"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3b/pool_proj_bn" type: "BN" bottom: "flow_inception_3b/pool_proj" top: "flow_inception_3b/pool_proj_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3b/relu_pool_proj" type: "ReLU" bottom: "flow_inception_3b/pool_proj_bn" top: "flow_inception_3b/pool_proj_bn" }
layer { name: "flow_inception_3b/output" type: "Concat"
  bottom: "flow_inception_3b/1x1_bn"
  bottom: "flow_inception_3b/3x3_bn"
  bottom: "flow_inception_3b/double_3x3_2_bn"
  bottom: "flow_inception_3b/pool_proj_bn"
  top: "flow_inception_3b/output" }

####################################### inception_3c #######################################
layer { name: "flow_inception_3c/3x3_reduce" type: "Convolution" bottom: "flow_inception_3b/output" top: "flow_inception_3c/3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3c/3x3_reduce_bn" type: "BN" bottom: "flow_inception_3c/3x3_reduce" top: "flow_inception_3c/3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3c/relu_3x3_reduce" type: "ReLU" bottom: "flow_inception_3c/3x3_reduce_bn" top: "flow_inception_3c/3x3_reduce_bn" }
layer { name: "flow_inception_3c/3x3" type: "Convolution" bottom: "flow_inception_3c/3x3_reduce_bn" top: "flow_inception_3c/3x3"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 160 pad: 1 kernel_size: 3 stride: 2
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3c/3x3_bn" type: "BN" bottom: "flow_inception_3c/3x3" top: "flow_inception_3c/3x3_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3c/relu_3x3" type: "ReLU" bottom: "flow_inception_3c/3x3_bn" top: "flow_inception_3c/3x3_bn" }
layer { name: "flow_inception_3c/double_3x3_reduce" type: "Convolution" bottom: "flow_inception_3b/output" top: "flow_inception_3c/double_3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3c/double_3x3_reduce_bn" type: "BN" bottom: "flow_inception_3c/double_3x3_reduce" top: "flow_inception_3c/double_3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3c/relu_double_3x3_reduce" type: "ReLU" bottom: "flow_inception_3c/double_3x3_reduce_bn" top: "flow_inception_3c/double_3x3_reduce_bn" }
layer { name: "flow_inception_3c/double_3x3_1" type: "Convolution" bottom: "flow_inception_3c/double_3x3_reduce_bn" top: "flow_inception_3c/double_3x3_1"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3c/double_3x3_1_bn" type: "BN" bottom: "flow_inception_3c/double_3x3_1" top: "flow_inception_3c/double_3x3_1_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3c/relu_double_3x3_1" type: "ReLU" bottom: "flow_inception_3c/double_3x3_1_bn" top: "flow_inception_3c/double_3x3_1_bn" }
layer { name: "flow_inception_3c/double_3x3_2" type: "Convolution" bottom: "flow_inception_3c/double_3x3_1_bn" top: "flow_inception_3c/double_3x3_2"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3 stride: 2
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_3c/double_3x3_2_bn" type: "BN" bottom: "flow_inception_3c/double_3x3_2" top: "flow_inception_3c/double_3x3_2_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_3c/relu_double_3x3_2" type: "ReLU" bottom: "flow_inception_3c/double_3x3_2_bn" top: "flow_inception_3c/double_3x3_2_bn" }
layer { name: "flow_inception_3c/pool" type: "Pooling" bottom: "flow_inception_3b/output" top: "flow_inception_3c/pool"
  pooling_param { pool: MAX kernel_size: 3 stride: 2 } }
layer { name: "flow_inception_3c/output" type: "Concat"
  bottom: "flow_inception_3c/3x3_bn"
  bottom: "flow_inception_3c/double_3x3_2_bn"
  bottom: "flow_inception_3c/pool"
  top: "flow_inception_3c/output" }

####################################### inception_4a #######################################
layer { name: "flow_inception_4a/1x1" type: "Convolution" bottom: "flow_inception_3c/output" top: "flow_inception_4a/1x1"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 224 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4a/1x1_bn" type: "BN" bottom: "flow_inception_4a/1x1" top: "flow_inception_4a/1x1_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4a/relu_1x1" type: "ReLU" bottom: "flow_inception_4a/1x1_bn" top: "flow_inception_4a/1x1_bn" }
layer { name: "flow_inception_4a/3x3_reduce" type: "Convolution" bottom: "flow_inception_3c/output" top: "flow_inception_4a/3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4a/3x3_reduce_bn" type: "BN" bottom: "flow_inception_4a/3x3_reduce" top: "flow_inception_4a/3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4a/relu_3x3_reduce" type: "ReLU" bottom: "flow_inception_4a/3x3_reduce_bn" top: "flow_inception_4a/3x3_reduce_bn" }
layer { name: "flow_inception_4a/3x3" type: "Convolution" bottom: "flow_inception_4a/3x3_reduce_bn" top: "flow_inception_4a/3x3"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4a/3x3_bn" type: "BN" bottom: "flow_inception_4a/3x3" top: "flow_inception_4a/3x3_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4a/relu_3x3" type: "ReLU" bottom: "flow_inception_4a/3x3_bn" top: "flow_inception_4a/3x3_bn" }
layer { name: "flow_inception_4a/double_3x3_reduce" type: "Convolution" bottom: "flow_inception_3c/output" top: "flow_inception_4a/double_3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 96 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4a/double_3x3_reduce_bn" type: "BN" bottom: "flow_inception_4a/double_3x3_reduce" top: "flow_inception_4a/double_3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4a/relu_double_3x3_reduce" type: "ReLU" bottom: "flow_inception_4a/double_3x3_reduce_bn" top: "flow_inception_4a/double_3x3_reduce_bn" }
layer { name: "flow_inception_4a/double_3x3_1" type: "Convolution" bottom: "flow_inception_4a/double_3x3_reduce_bn" top: "flow_inception_4a/double_3x3_1"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 128 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4a/double_3x3_1_bn" type: "BN" bottom: "flow_inception_4a/double_3x3_1" top: "flow_inception_4a/double_3x3_1_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4a/relu_double_3x3_1" type: "ReLU" bottom: "flow_inception_4a/double_3x3_1_bn" top: "flow_inception_4a/double_3x3_1_bn" }
layer { name: "flow_inception_4a/double_3x3_2" type: "Convolution" bottom: "flow_inception_4a/double_3x3_1_bn" top: "flow_inception_4a/double_3x3_2"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 128 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4a/double_3x3_2_bn" type: "BN" bottom: "flow_inception_4a/double_3x3_2" top: "flow_inception_4a/double_3x3_2_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4a/relu_double_3x3_2" type: "ReLU" bottom: "flow_inception_4a/double_3x3_2_bn" top: "flow_inception_4a/double_3x3_2_bn" }
layer { name: "flow_inception_4a/pool" type: "Pooling" bottom: "flow_inception_3c/output" top: "flow_inception_4a/pool"
  pooling_param { pool: AVE kernel_size: 3 stride: 1 pad: 1 } }
layer { name: "flow_inception_4a/pool_proj" type: "Convolution" bottom: "flow_inception_4a/pool" top: "flow_inception_4a/pool_proj"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4a/pool_proj_bn" type: "BN" bottom: "flow_inception_4a/pool_proj" top: "flow_inception_4a/pool_proj_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4a/relu_pool_proj" type: "ReLU" bottom: "flow_inception_4a/pool_proj_bn" top: "flow_inception_4a/pool_proj_bn" }
layer { name: "flow_inception_4a/output" type: "Concat"
  bottom: "flow_inception_4a/1x1_bn"
  bottom: "flow_inception_4a/3x3_bn"
  bottom: "flow_inception_4a/double_3x3_2_bn"
  bottom: "flow_inception_4a/pool_proj_bn"
  top: "flow_inception_4a/output" }

####################################### inception_4b #######################################
layer { name: "flow_inception_4b/1x1" type: "Convolution" bottom: "flow_inception_4a/output" top: "flow_inception_4b/1x1"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 192 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4b/1x1_bn" type: "BN" bottom: "flow_inception_4b/1x1" top: "flow_inception_4b/1x1_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4b/relu_1x1" type: "ReLU" bottom: "flow_inception_4b/1x1_bn" top: "flow_inception_4b/1x1_bn" }
layer { name: "flow_inception_4b/3x3_reduce" type: "Convolution" bottom: "flow_inception_4a/output" top: "flow_inception_4b/3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 96 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4b/3x3_reduce_bn" type: "BN" bottom: "flow_inception_4b/3x3_reduce" top: "flow_inception_4b/3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4b/relu_3x3_reduce" type: "ReLU" bottom: "flow_inception_4b/3x3_reduce_bn" top: "flow_inception_4b/3x3_reduce_bn" }
layer { name: "flow_inception_4b/3x3" type: "Convolution" bottom: "flow_inception_4b/3x3_reduce_bn" top: "flow_inception_4b/3x3"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 128 pad: 1 kernel_size: 3
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4b/3x3_bn" type: "BN" bottom: "flow_inception_4b/3x3" top: "flow_inception_4b/3x3_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4b/relu_3x3" type: "ReLU" bottom: "flow_inception_4b/3x3_bn" top: "flow_inception_4b/3x3_bn" }
layer { name: "flow_inception_4b/double_3x3_reduce" type: "Convolution" bottom: "flow_inception_4a/output" top: "flow_inception_4b/double_3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 96 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4b/double_3x3_reduce_bn" type: "BN" bottom: "flow_inception_4b/double_3x3_reduce" top: "flow_inception_4b/double_3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4b/relu_double_3x3_reduce" type: "ReLU" bottom: "flow_inception_4b/double_3x3_reduce_bn" top: "flow_inception_4b/double_3x3_reduce_bn" }
layer { name: "flow_inception_4b/double_3x3_1" type: "Convolution" bottom: "flow_inception_4b/double_3x3_reduce_bn" top: "flow_inception_4b/double_3x3_1"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 128 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4b/double_3x3_1_bn" type: "BN" bottom: "flow_inception_4b/double_3x3_1" top: "flow_inception_4b/double_3x3_1_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4b/relu_double_3x3_1" type: "ReLU" bottom: "flow_inception_4b/double_3x3_1_bn" top: "flow_inception_4b/double_3x3_1_bn" }
layer { name: "flow_inception_4b/double_3x3_2" type: "Convolution" bottom: "flow_inception_4b/double_3x3_1_bn" top: "flow_inception_4b/double_3x3_2"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 128 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4b/double_3x3_2_bn" type: "BN" bottom: "flow_inception_4b/double_3x3_2" top: "flow_inception_4b/double_3x3_2_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4b/relu_double_3x3_2" type: "ReLU" bottom: "flow_inception_4b/double_3x3_2_bn" top: "flow_inception_4b/double_3x3_2_bn" }
layer { name: "flow_inception_4b/pool" type: "Pooling" bottom: "flow_inception_4a/output" top: "flow_inception_4b/pool"
  pooling_param { pool: AVE kernel_size: 3 stride: 1 pad: 1 } }
layer { name: "flow_inception_4b/pool_proj" type: "Convolution" bottom: "flow_inception_4b/pool" top: "flow_inception_4b/pool_proj"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4b/pool_proj_bn" type: "BN" bottom: "flow_inception_4b/pool_proj" top: "flow_inception_4b/pool_proj_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4b/relu_pool_proj" type: "ReLU" bottom: "flow_inception_4b/pool_proj_bn" top: "flow_inception_4b/pool_proj_bn" }
layer { name: "flow_inception_4b/output" type: "Concat"
  bottom: "flow_inception_4b/1x1_bn"
  bottom: "flow_inception_4b/3x3_bn"
  bottom: "flow_inception_4b/double_3x3_2_bn"
  bottom: "flow_inception_4b/pool_proj_bn"
  top: "flow_inception_4b/output" }

####################################### inception_4c #######################################
layer { name: "flow_inception_4c/1x1" type: "Convolution" bottom: "flow_inception_4b/output" top: "flow_inception_4c/1x1"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 160 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4c/1x1_bn" type: "BN" bottom: "flow_inception_4c/1x1" top: "flow_inception_4c/1x1_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4c/relu_1x1" type: "ReLU" bottom: "flow_inception_4c/1x1_bn" top: "flow_inception_4c/1x1_bn" }
layer { name: "flow_inception_4c/3x3_reduce" type: "Convolution" bottom: "flow_inception_4b/output" top: "flow_inception_4c/3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4c/3x3_reduce_bn" type: "BN" bottom: "flow_inception_4c/3x3_reduce" top: "flow_inception_4c/3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4c/relu_3x3_reduce" type: "ReLU" bottom: "flow_inception_4c/3x3_reduce_bn" top: "flow_inception_4c/3x3_reduce_bn" }
layer { name: "flow_inception_4c/3x3" type: "Convolution" bottom: "flow_inception_4c/3x3_reduce_bn" top: "flow_inception_4c/3x3"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 160 pad: 1 kernel_size: 3
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4c/3x3_bn" type: "BN" bottom: "flow_inception_4c/3x3" top: "flow_inception_4c/3x3_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4c/relu_3x3" type: "ReLU" bottom: "flow_inception_4c/3x3_bn" top: "flow_inception_4c/3x3_bn" }
layer { name: "flow_inception_4c/double_3x3_reduce" type: "Convolution" bottom: "flow_inception_4b/output" top: "flow_inception_4c/double_3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4c/double_3x3_reduce_bn" type: "BN" bottom: "flow_inception_4c/double_3x3_reduce" top: "flow_inception_4c/double_3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4c/relu_double_3x3_reduce" type: "ReLU" bottom: "flow_inception_4c/double_3x3_reduce_bn" top: "flow_inception_4c/double_3x3_reduce_bn" }
layer { name: "flow_inception_4c/double_3x3_1" type: "Convolution" bottom: "flow_inception_4c/double_3x3_reduce_bn" top: "flow_inception_4c/double_3x3_1"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 160 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4c/double_3x3_1_bn" type: "BN" bottom: "flow_inception_4c/double_3x3_1" top: "flow_inception_4c/double_3x3_1_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4c/relu_double_3x3_1" type: "ReLU" bottom: "flow_inception_4c/double_3x3_1_bn" top: "flow_inception_4c/double_3x3_1_bn" }
layer { name: "flow_inception_4c/double_3x3_2" type: "Convolution" bottom: "flow_inception_4c/double_3x3_1_bn" top: "flow_inception_4c/double_3x3_2"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 160 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4c/double_3x3_2_bn" type: "BN" bottom: "flow_inception_4c/double_3x3_2" top: "flow_inception_4c/double_3x3_2_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4c/relu_double_3x3_2" type: "ReLU" bottom: "flow_inception_4c/double_3x3_2_bn" top: "flow_inception_4c/double_3x3_2_bn" }
layer { name: "flow_inception_4c/pool" type: "Pooling" bottom: "flow_inception_4b/output" top: "flow_inception_4c/pool"
  pooling_param { pool: AVE kernel_size: 3 stride: 1 pad: 1 } }
layer { name: "flow_inception_4c/pool_proj" type: "Convolution" bottom: "flow_inception_4c/pool" top: "flow_inception_4c/pool_proj"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4c/pool_proj_bn" type: "BN" bottom: "flow_inception_4c/pool_proj" top: "flow_inception_4c/pool_proj_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4c/relu_pool_proj" type: "ReLU" bottom: "flow_inception_4c/pool_proj_bn" top: "flow_inception_4c/pool_proj_bn" }
layer { name: "flow_inception_4c/output" type: "Concat"
  bottom: "flow_inception_4c/1x1_bn"
  bottom: "flow_inception_4c/3x3_bn"
  bottom: "flow_inception_4c/double_3x3_2_bn"
  bottom: "flow_inception_4c/pool_proj_bn"
  top: "flow_inception_4c/output" }

####################################### inception_4d #######################################
layer { name: "flow_inception_4d/1x1" type: "Convolution" bottom: "flow_inception_4c/output" top: "flow_inception_4d/1x1"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 96 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4d/1x1_bn" type: "BN" bottom: "flow_inception_4d/1x1" top: "flow_inception_4d/1x1_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4d/relu_1x1" type: "ReLU" bottom: "flow_inception_4d/1x1_bn" top: "flow_inception_4d/1x1_bn" }
layer { name: "flow_inception_4d/3x3_reduce" type: "Convolution" bottom: "flow_inception_4c/output" top: "flow_inception_4d/3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4d/3x3_reduce_bn" type: "BN" bottom: "flow_inception_4d/3x3_reduce" top: "flow_inception_4d/3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4d/relu_3x3_reduce" type: "ReLU" bottom: "flow_inception_4d/3x3_reduce_bn" top: "flow_inception_4d/3x3_reduce_bn" }
layer { name: "flow_inception_4d/3x3" type: "Convolution" bottom: "flow_inception_4d/3x3_reduce_bn" top: "flow_inception_4d/3x3"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 192 pad: 1 kernel_size: 3
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4d/3x3_bn" type: "BN" bottom: "flow_inception_4d/3x3" top: "flow_inception_4d/3x3_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4d/relu_3x3" type: "ReLU" bottom: "flow_inception_4d/3x3_bn" top: "flow_inception_4d/3x3_bn" }
layer { name: "flow_inception_4d/double_3x3_reduce" type: "Convolution" bottom: "flow_inception_4c/output" top: "flow_inception_4d/double_3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 160 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4d/double_3x3_reduce_bn" type: "BN" bottom: "flow_inception_4d/double_3x3_reduce" top: "flow_inception_4d/double_3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4d/relu_double_3x3_reduce" type: "ReLU" bottom: "flow_inception_4d/double_3x3_reduce_bn" top: "flow_inception_4d/double_3x3_reduce_bn" }
layer { name: "flow_inception_4d/double_3x3_1" type: "Convolution" bottom: "flow_inception_4d/double_3x3_reduce_bn" top: "flow_inception_4d/double_3x3_1"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 192 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4d/double_3x3_1_bn" type: "BN" bottom: "flow_inception_4d/double_3x3_1" top: "flow_inception_4d/double_3x3_1_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4d/relu_double_3x3_1" type: "ReLU" bottom: "flow_inception_4d/double_3x3_1_bn" top: "flow_inception_4d/double_3x3_1_bn" }
layer { name: "flow_inception_4d/double_3x3_2" type: "Convolution" bottom: "flow_inception_4d/double_3x3_1_bn" top: "flow_inception_4d/double_3x3_2"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 192 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4d/double_3x3_2_bn" type: "BN" bottom: "flow_inception_4d/double_3x3_2" top: "flow_inception_4d/double_3x3_2_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4d/relu_double_3x3_2" type: "ReLU" bottom: "flow_inception_4d/double_3x3_2_bn" top: "flow_inception_4d/double_3x3_2_bn" }
layer { name: "flow_inception_4d/pool" type: "Pooling" bottom: "flow_inception_4c/output" top: "flow_inception_4d/pool"
  pooling_param { pool: AVE kernel_size: 3 stride: 1 pad: 1 } }
layer { name: "flow_inception_4d/pool_proj" type: "Convolution" bottom: "flow_inception_4d/pool" top: "flow_inception_4d/pool_proj"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4d/pool_proj_bn" type: "BN" bottom: "flow_inception_4d/pool_proj" top: "flow_inception_4d/pool_proj_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4d/relu_pool_proj" type: "ReLU" bottom: "flow_inception_4d/pool_proj_bn" top: "flow_inception_4d/pool_proj_bn" }
layer { name: "flow_inception_4d/output" type: "Concat"
  bottom: "flow_inception_4d/1x1_bn"
  bottom: "flow_inception_4d/3x3_bn"
  bottom: "flow_inception_4d/double_3x3_2_bn"
  bottom: "flow_inception_4d/pool_proj_bn"
  top: "flow_inception_4d/output" }

####################################### inception_4e #######################################
layer { name: "flow_inception_4e/3x3_reduce" type: "Convolution" bottom: "flow_inception_4d/output" top: "flow_inception_4e/3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4e/3x3_reduce_bn" type: "BN" bottom: "flow_inception_4e/3x3_reduce" top: "flow_inception_4e/3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4e/relu_3x3_reduce" type: "ReLU" bottom: "flow_inception_4e/3x3_reduce_bn" top: "flow_inception_4e/3x3_reduce_bn" }
layer { name: "flow_inception_4e/3x3" type: "Convolution" bottom: "flow_inception_4e/3x3_reduce_bn" top: "flow_inception_4e/3x3"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 192 pad: 1 kernel_size: 3 stride: 2
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4e/3x3_bn" type: "BN" bottom: "flow_inception_4e/3x3" top: "flow_inception_4e/3x3_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  bn_param { engine: CAFFE frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "flow_inception_4e/relu_3x3" type: "ReLU" bottom: "flow_inception_4e/3x3_bn" top: "flow_inception_4e/3x3_bn" }
layer { name: "flow_inception_4e/double_3x3_reduce" type: "Convolution" bottom: "flow_inception_4d/output" top: "flow_inception_4e/double_3x3_reduce"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { num_output: 192 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "flow_inception_4e/double_3x3_reduce_bn" type: "BN" bottom: "flow_inception_4e/double_3x3_reduce" top: "flow_inception_4e/double_3x3_reduce_bn"
  param { lr_mult: 0 decay_mult: 0 } param { lr_mult: 0 decay_mult: 0 }
